import React from 'react';

import Button from '../../common/components/Button';
import CardMenu from '../../common/components/CardMenu';
import styles from './about.module.css'
import { Link } from 'react-router-dom';

import AboutFirstImg from '../../assets/images/about1.png';
import AboutSecondImg from '../../assets/images/about2.png';

const About = () => {

	return (
		<div className={styles.wrapper}>
			<div className={styles.main}>
				<div className={styles.menu}>
					<h1>
						Волонтерські та громадскі ініціативи, що працюють в Україні та за її межами.
					</h1>
					<div className={styles.buttons}>
						<Link to="/form-feedback">
							<Button text="Зв'язатись з нами" />

						</Link>
						<Link to="/">

							<Button text="Головна сторінка" />

						</Link>
					</div>
				</div>
				<img className={styles.postimg} src={AboutFirstImg} alt="about1" />
			</div>
			<div className={styles.net}>
				<div className={styles.info1}>
					<h2>
						Для чого цей сайт?
					</h2>
					<p>
						Наша мета: допомогти військовим, які захищають нашу державу в такий нелегкий час, Він також дасть можливість волонтерам, активним громадянам, які хочуть долучитися до ініціатив та людям, які потребують допомогу — знайти одне одного.
					</p>
				</div>
				<div className={styles.info2}>
					<h2>
						Як шукати інформацію?
					</h2>
					<p>
						Оберіть вид допомоги, яку ви хочете запропонувати чи яка вам необхідна. Далі ви можете скористатись фільтрами для полегшення пошуку інформації. Ви отримаєте перелік актуальних волонтерських пропозицій або потреб від військових чи  волонтерів.
					</p>
				</div>
				<div className={styles.info3}>
					<h2>
						Структура сайту
					</h2>
					<p>
						<span className={styles.strong}>Фонди та реквізити:</span>
						Для надання допомоги українським воїнам сьогодні працюють різні організації та рахунки, які збирають фінансову допомогу та допомагають армії в госпіталях, на складах, полігонах, боротьбі з дезінформацією і не тільки. Тут ви знайдете офіційні, достовірні та найоптимальніші способи внести донат.

					</p>
					<p>
						<span className={styles.strong}></span>Благодійні проекти:
						Тут ви зможете знайти перелік різноманітних проектів, які організовують волонтери, для наших захисників, Також можна подати заявку і поділитись з нами вашим проектом.
					</p>
					<p>
						<span className={styles.strong}>Реабілітація військових:</span>
						Чимало наших військових потребують фінансової допомоги на лікування. Ви можете ознайомитись з історіє. кожного та здійснити свій донат.
					</p>
					<p>
						<span className={styles.strong}>Запити матеріальної допомоги:</span>
						У цій категорії можна дізнатися, якої співучасті потребують наші військові чи волонтери. Тут ви також можете запропонувати свою допомогу, чи матеріальну, чи фізичну. Кожен наш крок веде до перемоги!
					</p>
				</div>
				<img className={styles.img} src={AboutSecondImg} alt="about" />
				<div className={styles.info4}>
					<h2>
						Як публікувати інформацію?
					</h2>
					<p>
						В залежності від категорії у вас буде змога опублікувати різні види запитів. Вам відкриється спеціальна анкета, яку необхідно заповнити. Після цього анкету отримаємо ми. В дуже короткий термін ми подзвонимо вам, щоб перевірити всі дані. Якщо все правильно — публікуємо.
					</p>
				</div>
			</div>
		</div>
	);
}

export default About;